 &НаСервере 
Функция ПолучитьГруппу() Экспорт   
	
    Перем КодОКВЭД;
	
	//КодОКВЭД = "000000389";
	   КодОКВЭД = "000000713";// "000000250";
	СсылкаНаГруппу = Справочники.СправочникОКВЭД.НайтиПоКоду(КодОКВЭД);
	Сообщить(СсылкаНаГруппу);
   Возврат СсылкаНаГруппу;
   
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
     
   // Параметр    = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Параметр1    = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("START_DATE"));  
	Параметр2    = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЭтоГруппа"));  
   // Параметр.Значение   = ТекущаяДата();  
    //
  // Параметр.Значение   = Дата("23.01.2023 12:57:10"); 
    Параметр1.Значение   =  Дата("01.01.2022 00:00:00"); 
	Параметр2.Значение   =  ПолучитьГруппу();

//    Параметр.Значение   = Тек_ПараметрыСеанс();
    Параметр1.Использование = Истина;
    Параметр2.Использование = Истина;
 
КонецПроцедуры


