 &НаСервере 
Функция ПолучитьГруппу() Экспорт   
	
    Перем КодОКВЭД;
	
	//КодОКВЭД = "000000389";
	 Код = "000000220";
	//СсылкаНаГруппу = Справочники.СправочникОКВЭД.НайтиПоКоду(КодОКВЭД);
	   СсылкаНаГруппу = Справочники.Организации.НайтиПоКоду(Код);
   Возврат СсылкаНаГруппу;
   
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
     
   // Параметр    = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Параметр1    = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("START_DATE"));  
//	Параметр2    = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));  
   // Параметр.Значение   = ТекущаяДата();  
    //
   Параметр1.Значение   = Дата("01.01.2022 00:00:00"); 
    //Параметр1.Значение   = ПолучитьГруппу();
   // Параметр2.Значение   = Тек_ПараметрыСеанс();
 //   Параметр2.Значение   = ПолучитьГруппу();
	
//    Параметр.Значение   = Тек_ПараметрыСеанс();
    Параметр1.Использование = Истина;
  //  Параметр2.Использование = Истина;
 
КонецПроцедуры

