//  &НаСервере 
//Функция ПолучитьГруппу() Экспорт   
//	
//    Перем КодОКВЭД;
//	
//	//КодОКВЭД = "000000389";
//	   КодОКВЭД = "000000001";
//	СсылкаНаГруппу = Справочники.СправочникОКВЭД.НайтиПоКоду(КодОКВЭД);
//	
//   Возврат СсылкаНаГруппу;
//   
//КонецФункции

//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//     
//   // Параметр    = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
////	Параметр1    = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЭтоГруппа"));  
////	Параметр2    = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Подразделение"));  
//   // Параметр.Значение   = ТекущаяДата();  
//    //
//  // Параметр.Значение   = Дата("23.01.2023 12:57:10"); 
//  //  Параметр1.Значение   = ПолучитьГруппу();
//  //  Параметр2.Значение   = Тек_ПараметрыСеанс();

////    Параметр.Значение   = Тек_ПараметрыСеанс();
// //   Параметр1.Использование = Истина;
// //   Параметр2.Использование = Истина;
// 
//КонецПроцедуры
